import { Card, CardContent } from "@/components/ui/card";
import BlogSidebar from "@/components/ui/blog-sidebar";
import Link from "next/link";

export default function Page () {

    const posts = [
        {title: 'این یک تست است', slug: 'test', shortDescrption: '', descrption: '', date: new Date()}
    ]
    
    return (
        <div className="flex flex-col w-full">
            <div className="mt-20 grid grid-cols-4 justify-between gap-20">
                <div className="md:col-span-1 col-span-4">
                    <BlogSidebar />
                </div>
                <div className="md:col-span-3 col-span-4 flex flex-col" dir="rtl">
                    <div>
                        <div className="flex justify-between items-center">
                            <p className="text-[36px] font-bold">
                                <Link href={'test'}>
                                    عنوان
                                </Link>
                            </p>

                            <p className="text-secondary">
                                ۱۴۰۳/۲/۱
                            </p>
                        </div>
                        <p className="text-justify">
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. 
                        </p>
                    </div>

                    <div>
                        <div className="flex justify-between items-center">
                            <p className="text-[36px] font-bold">
                                <Link href={'test'}>
                                    عنوان
                                </Link>
                            </p>

                            <p className="text-secondary">
                                ۱۴۰۳/۲/۱
                            </p>
                        </div>
                        <p className="text-justify">
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. 
                        </p>
                    </div>
                    <div>
                        <div className="flex justify-between items-center">
                            <p className="text-[36px] font-bold">
                                <Link href={'/blog/test'}>
                                    عنوان
                                </Link>
                            </p>

                            <p className="text-secondary">
                                ۱۴۰۳/۲/۱
                            </p>
                        </div>
                        <p className="text-justify">
                        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. 
                        </p>
                    </div>
                </div>
            </div>
        </div>
    )
}